[
  {
    "bookId": 1,
    "title": "Robot Bangarang",
    "description": "When you're a demon hunter, you probably shouldn't invite a succubus into your bed...\n\n\nBlaze is a highly trained astral marine, fighting demons and saving lives, so he should know better than to bed his latest client. And yet, when she puts a hex on him, suddenly women find him irresistible. Even his ex-wife is eyeing him, which is a problem, because she's an evil witch. Literally.\nTogether, Blaze and Mara form an uneasy alliance with a misfit crew of aliens and monsters to track down demons, snare ghosts, and destroy hellish creatures bent on murder--all while trying to close the gates of hell forever.\n\n\nThere's just one problem. A demon-possessed robot has infiltrated their starship, the Lizzie Borden, and a vicious coven of stellar vampires have stranded them in a graveyard of ships at the edge of known space. All the while, the women on his crew won't leave Blaze alone!\n\n\nFrom Aaron Crash, author of the American Dragons series and the litRPG epic War God's Mantle, comes a brand new shoot-em-up, action adventure, paranormal space opera you won't want to put down. This novel contains swearing, violence, cyborg vampires, and a harem of beautiful if somewhat inhuman women that the hero regularly sleeps with--when he's not hunting demons. Enjoy!\n\n\nA Note from the Author: ROBOT BANGARANG was originally published as DAMNATION ROBOT and what you are about to read is the re-mix. Now, this is important, if you already read DAMNATION ROBOT, you might think twice about this book. There are a lot of similarities. I eased up on some of the horror elements and added some sexy times, so those scenes involve one or more beautiful women, but a lot of the main plot is still the same.\n\nStill, if you read and LOVED DR, this will be a variation on something you already like, which can be fun. I hope it's fun because I really liked these books. They didn't quite find their audience, however. Sad face. I'm hoping with a little re-imagining, they'll find readers who like a little spicy in their supernatural space opera. Happy face!\n\nNow, if you didn't read DAMNATION ROBOT at all, you're totally fine. I'm Aaron Crash and I approve of this book.\n\nI'd like to thank Shadow Alley Press for allowing the re-mix. Also, thanks to Byl Karvetz for being a fan, and all the people who read and left reviews.",
    "image": "",
    "series": {
      "name": "Full Frontal Galaxy",
      "slug": "full-frontal-galaxy",
      "order": 1
    },
    "format": {
      "ebook": {
        "url": "https://a.co/d/eQSsMbg",
        "createDate": "2019-06-25T18:30:00.000Z"
      },
      "PRINT_BOOK_PAPER_BACK": {
        "url": "https://a.co/d/gBz4XZ7",
        "createDate": "2019-11-15T18:30:00.000Z"
      },
      "audiobook": {
        "url": "https://a.co/d/gHjnfpm",
        "createDate": "2020-01-21T18:30:00.000Z"
      }
    }
  },
  {
    "bookId": 2,
    "title": "Space Dragon Boogaloo",
    "description": "More Women, More Ghosts, and More Ancient Evil… A Demon Hunter's Work is Never Done.\n\nAfter defeating the Archduchess of Necrotechnology, Blaze Ramirez and the crew of the Lizzie Bordenare still on the run, wanted dead or alive by the Interstellar Presidential Corporation. Despite their problems with the law, the demon hunters have never been closer to destroying the Onyx Gate and freeing the universe from its evil.\n\nHowever, the one person in the galaxy who might know the location of the gate is trapped on a haunted planet, doomed to die as its two stars collide. And standing between Blaze and the mysterious granny is an army of the walking dead, vicious specters, and beautiful blonde woman with assets Blaze can't ignore. Suddenly, he's grateful for the bad case of succubus herpes Dixie the Demon gave him.\n\nFrom the author of War God's Mantle (a litRPG Adventure) and American Dragons (Harem Gamelit) comes a steamy, action-packed thrill ride that is equal parts Warhammer 40K and Shadowrun, with a healthy dose of sexy to spice up the ride.\n\nA Note from the Author: SPACE DRAGON BOOGALOO was originally published as NEUTRON DRAGON ATTACK (Galactic Demon Hunters Book 2) and what you are about to read is the re-mix. Now, this is important, if you already read NEUTRON DRAGON ATTACK, you might think twice about this book. There are a lot of similarities. I eased up on some of the horror elements and added some sexy times, so those scenes involve one or more beautiful women, but a lot of the main plot is still the same.\n\nStill, if you read and LOVED NDA, this will be a variation on something you already like, which can be fun. I hope it's fun because I really liked these books. They didn't quite find their audience, however. Sad face. I'm hoping with a little re-imagining, they'll find readers who like a little spicy in their supernatural space opera. Happy face!\n\nNow, if you didn't read NEUTRON DRAGON ATTACK at all, you're totally fine. I'm Aaron Crash and I approve of this book.",
    "image": "",
    "series": {
      "name": "Full Frontal Galaxy",
      "slug": "full-frontal-galaxy",
      "order": 2
    },
    "format": {
      "ebook": {
        "url": "https://a.co/d/fabGqaW",
        "createDate": "2019-08-27T18:30:00.000Z"
      },
      "PRINT_BOOK_PAPER_BACK": {
        "url": "https://a.co/d/2YhdZcf",
        "createDate": "2019-12-01T18:30:00.000Z"
      }
    }
  },
  {
    "bookId": 3,
    "title": "Boss Build: A Monster Girl Adventure",
    "description": "Roy Boss, the CEO of VentureForge Industries, just woke up in a different galaxy.\n\n\nHe's lost his company and his body, and the man who murdered him might still be alive. The good news is he's on Plymouth, an almost mythical world where monsters are designed and printed for Roy's game worlds. First order of the day: print himself a superpowered body and get back what's his.\n\nBut everything isn't as it seems. The research lab he arrived in is deserted except for a few dead security guards, and the streets outside are filled with thousands of robot dogs programmed for one single purpose: kill Roy Boss.\n\nBut Roy has an entire catalog of savior-class monster girls he can print up to help him clean house, each with their own powers, transformations, and fetishes. Hit Print for justice, for satisfaction, and for the love of the game.\n\nFrom Aaron Crash, bestselling author of Barbarian Outcast and the American Dragon series, comes a brand-new world that will leave you turning pages late into the night.\n\nDisclaimer: Boss Build is an explicit sci-if harem adventure. There are girls, guns, and sex on the page. Each of Roy's monster girls is fully configurable when it comes to bedroom activities. It's like a smutty I Am Legend meets Westworld. You have been warned.",
    "image": "",
    "series": {
      "name": "Creature Girl Creations",
      "slug": "creature-girl-creations",
      "order": 1
    },
    "format": {
      "ebook": {
        "url": "https://a.co/d/2tbBcbF",
        "createDate": "2020-09-22T18:30:00.000Z"
      },
      "PRINT_BOOK_PAPER_BACK": {
        "url": "https://a.co/d/eqMAE0T",
        "createDate": "2020-10-18T18:30:00.000Z"
      },
      "audiobook": {
        "url": "https://a.co/d/7e0J0N6",
        "createDate": "2020-12-03T18:30:00.000Z"
      }
    }
  },
  {
    "bookId": 4,
    "title": "Master Build: A Monster Girl Adventure",
    "description": "What lies beneath this planet of mystery?\n\nRoy Boss had it made. He had three sexy monster girls and two cute baby girls, and he murdered the hell out of the guy who stole his company. The only thing left to do was to go back through the stargate and take back his property… or at least that's what he thought before the gateway to the planet's underworld swung open.\n\nThe revelations of the deep dark are astounding: the birth of the Pelerine, the secrets of the Coptics, and the arrival of the UnWolf. But by learning the secret histories, Roy has drawn the attentions of an ancient foe. He'll have to level up, gather more resources, and print his own army of monsters, or the planet of Plymouth will die a second time—and this time, the future of the Milky Way Galaxy might perish with it.\n\nFrom Aaron Crash, bestselling author of Barbarian Outcast and the American Dragon series, comes a brand-new world that will leave you turning pages late into the night.\n\nDisclaimer: Master Build is an explicit sci-if harem adventure. There are girls, guns, and sex on the page. Each of Roy's monster girls is fully configurable when it comes to bedroom activities. It's like a smutty I Am Legend meets Westworld. You have been warned.",
    "image": "",
    "series": {
      "name": "Creature Girl Creations",
      "slug": "creature-girl-creations",
      "order": 2
    },
    "format": {
      "ebook": {
        "url": "https://a.co/d/dIM4Ljx",
        "createDate": "2020-12-03T18:30:00.000Z"
      },
      "PRINT_BOOK_PAPER_BACK": {
        "url": "https://a.co/d/1XQp4HM",
        "createDate": "2021-01-06T18:30:00.000Z"
      },
      "audiobook": {
        "url": "https://a.co/d/7THrLhd",
        "createDate": "2021-03-09T18:30:00.000Z "
      }
    }
  },
  {
    "bookId": 5,
    "title": "God Build: A Monster Girl Adventure",
    "description": "He's done playing. Now, he's going to win.\n\nRoy Boss has the planet of Plymouth all to himself. He's beaten back his enemies in the Milky Way Galaxy and he's destroyed Morcom. Now it's time to get his company back. To do that, he'll need to play a game with a sexy new opponent in space. He'll have to undo her plans, run her dungeons, and get to the Plymouth Gate, where the war is only just beginning.\n\nLuckily, Roy has the help of the monster girls he's created, as well as more on the way. He's designed an army to win, but not everything is going so smoothly inside his family. The niddies are growing up and want prey. Suzanne, the sexy snake woman, isn't about to make life easy, and a pregnant Tails is proving that hell hath no fury like a hungry fox girl. Even Halcyon, the insatiable A.I., is having issues. Roy will have to deal with his women and win his way across the galaxies to reclaim what is rightfully his in this epic conclusion of the Creature Girl Creations trilogy.\n\nDisclaimer: God Build is an explicit sci-if harem adventure. There are girls, guns, and sex on the page. Each of Roy's monster girls is fully configurable when it comes to bedroom activities. It's like a smutty I Am Legend meets Westworld. You have been warned.",
    "image": "",
    "series": {
      "name": "Creature Girl Creations",
      "slug": "creature-girl-creations",
      "order": 3
    },
    "format": {
      "ebook": {
        "url": "https://a.co/d/99U03Zp",
        "createDate": "2021-02-09T18:30:00.000Z"
      },
      "PRINT_BOOK_PAPER_BACK": {
        "url": "https://a.co/d/hqsgmde",
        "createDate": "2021-02-18T18:30:00.000Z"
      }
    }
  },
  {
    "bookId": 6,
    "title": "War God's Mantle: Ascension",
    "description": "The gods walk again …\n\n\n\n\nWhen Marine Corps pilot Jacob Merely crashes during a routine mission off the coast of Cyprus, he was sure it was game over.\n\nAfter surviving the crash and pulling himself onto the sandy shores of a long-abandoned island, however, Jacob unwittingly stumbles headfirst into the ancient ruins of a dead city. Unfortunately, he also stumbles into an age-old battle between good and evil—and he is now its newest recruit.\n\nThe island once belonged to the Amazons, daughters of Ares, the God of War, and stood as the final bastion between the human world and the monstrosities of the Great Below. But Jacob's arrival has awakened the old gods and disturbed the seal holding the ravaging darkness at bay.\n\nNow, with the help of a sacred gem containing Ares' power, Jacob must recreate the Amazonian defenders of humanity and fortify the island stronghold. And if he fails, Hades will unleash his army of the damned and the world of men will fall, giving rise to an age of walking nightmares.\n\nCheck out War God's Mantle by James A. Hunter, author of Rogue Dungeon and the litRPG epic Viridian Gate Online, and Aaron Crash, author of the bestselling American Dragons series.\n\n\n\"You had me at mythology. You sold me at the crafting, game mechanics, great characters, and serious action. From start to finish, War God's Mantle delivers. Do not miss this book!\" — Harmon Cooper, author of Cheery Blossom Girls, Monster Hunt NYC,and House of Dolls.\n",
    "image": "",
    "series": {
      "name": "The War God Saga",
      "slug": "the-war-god-saga",
      "order": 1
    },
    "format": {
      "ebook": {
        "url": "https://a.co/d/h8itbfD",
        "createDate": "2018-01-11T18:30:00.000Z"
      },
      "PRINT_BOOK_PAPER_BACK": {
        "url": "https://a.co/d/e2zwn04",
        "createDate": "2018-01-09T18:30:00.000Z"
      },
      "audiobook": {
        "url": "https://a.co/d/5gMfBNL",
        "createDate": "2018-02-20T18:30:00.000Z"
      }
    }
  },
  {
    "bookId": 7,
    "title": "War God's Mantle: Descent",
    "description": "A Marine turned Greek God. An army of beautiful Amazons. An infernal enemy out to burn the world down.\n\n\n\n\nIt's been three weeks since Jacob Merely crash-landed on the mythical island of Lycastia, and the newly minted War God finally has things under control. He's grown into his power, built his city, and earned the respect of his gorgeous, hard-charging Amazons.\n\nHe's not in the clear yet, though. Hades still lives, and the mystical sigil holding him at bay is rapidly failing. Worse, a horde of new enemies is battering Lycastia's gates daily, slowly grinding down Jacob's forces. But Jacob has a plan to get the upper hand. He's learned about a legendary weapon buried in a prehistoric world deep in the bowels of the island. A weapon with the power to kill even gods. If he can defeat the weapon's primordial guardians and subdue an exiled Titan, he might just be able to save the world.\n\nBut that's an awfully big if …\n\nContinue reading War God's Mantle, a litRPG Harem adventure by James A. Hunter, author of Viridian Gate Online, and Aaron Crash, author of the Galactic Demon Hunters series.\n\n",
    "image": "",
    "series": {
      "name": "The War God Saga",
      "slug": "the-war-god-saga",
      "order": 2
    },
    "format": {
      "ebook": {
        "url": "https://a.co/d/iwRfap0",
        "createDate": "2018-06-12T18:30:00.000Z"
      },
      "PRINT_BOOK_PAPER_BACK": {
        "url": "https://a.co/d/1D0BXZ6",
        "createDate": "2018-06-26T18:30:00.000Z"
      },
      "audiobook": {
        "url": "https://a.co/d/j9MR0BP",
        "createDate": "2018-08-07T18:30:00.000Z"
      }
    }
  },
  {
    "bookId": 8,
    "title": "War God's Mantle: Underworld",
    "description": "A Marine turned Greek God. An Army of Beautiful Amazons. One Final Battle against Death Itself.\n\n\n\n\nJacob Merely has secured the ultimate weapon against evil, the Crystal Scythe, and now it's time for him to bring the fight to Hades himself.\n\nUnfortunately, Earl Necro Earl and his undead forces stand in the way, so if Jacob is going to defeat the god of death, he's going to have to take out Earl first. Knocking Earl's teeth into the back of his throat? Yeah, Jacob is totally okay with that.\n\nAnd when a mysterious new woman arrives unexpectedly at their gates with no memory of who she is—but seems to know of a secret passageway into the heart of the Temple of Hades—Jacob finally has the last piece of the puzzle. But with every new battle won, Jacob is tempted to give into the rage and arrogance that consumed Ares.\n\nCan Jacob resist the temptation to become a total douchebag? Can he and his Amazons unravel the mystery behind the ancient Olympian War and finish a battle as old as time itself? And what new demons does Hades have to throw against the War God?\n\nContinue reading War God's Mantle by James A. Hunter, author of Rogue Dungeon and the litRPG epic Viridian Gate Online, and Aaron Crash, author of the bestselling American Dragons series.",
    "image": "",
    "series": {
      "name": "The War God Saga",
      "slug": "the-war-god-saga",
      "order": 3
    },
    "format": {
      "ebook": {
        "url": "https://a.co/d/0ClB0yl",
        "createDate": "2019-04-24T18:30:00.000Z"
      },
      "PRINT_BOOK_PAPER_BACK": {
        "url": "https://a.co/d/dw2ztp3",
        "createDate": "2019-08-12T18:30:00.000Z"
      },
      "audiobook": {
        "url": "https://a.co/d/fvwK7xo",
        "createDate": "2019-10-09T18:30:00.000Z"
      }
    }
  },
  {
    "bookId": 9,
    "title": "Rage King: An Urban Fantasy Men's Adventure",
    "description": "THE RAGE KING HAS AN UNQUENCHABLE LUST FOR DESTRUCTION!\n\nColt Holliday knows all too well how life can sometimes just piss you off, but he's learned to control his anger issues. Or so he thinks. When an ancient god takes over his soul, Colt is faced with a rage unlike any other. Now when he gets mad, he hits like a Category 5 hurricane after too many shots of Patrón.\n\nColt soon finds himself in an insane world of mythical creatures—vampires, werewolves, and demons—hiding among humans. These monsters will do anything to take this new power from him. Colt needs to control the god of rage, but to do that, he'll have to win the heart of a nerdy girl possessed by the goddess of lust and a sad vampire who swore she would never fall in love again.\n\nDisclaimer: Rage King is a steamy, rather slow-burn urban fantasy adventure that has the MC creating a harem to control the god of rage possessing him. The sex scenes are explicit. Welcome to a rich, brand-new world from Aaron Crash, the bestselling author of the American Dragons and the Princesses of the Ironbound series.",
    "image": "",
    "series": {
      "name": "Rage King",
      "slug": "rage-king",
      "order": 1
    },
    "format": {
      "ebook": {
        "url": "https://a.co/d/7gnGW2Z",
        "createDate": "2022-05-10T18:30:00.000Z"
      },
      "PRINT_BOOK_PAPER_BACK": {
        "url": "https://a.co/d/eU0E0cw",
        "createDate": "2022-05-10T18:30:00.000Z"
      },
      "audiobook": {
        "url": "https://a.co/d/6pyRMhm",
        "createDate": "2022-10-19T18:30:00.000Z "
      }
    }
  },
  {
    "bookId": 10,
    "title": "Rage King - Book Two: An Urban Fantasy Men's Adventure",
    "description": "It's a god-eat-god world and the RAGE KING is hungry!\nColt Holliday has the power of a god, and he's learning to control it. But that means gathering women to forge runes of power that give both him and his wives power undreamed of by mortal men.\n\nColt conquered the vampires, but now a pack of werewolves has moved into his territory. Accompanying the pack is a heartbreakingly beautiful wolf girl who has clawed her way into Colt's life and bed, but taking in the stray has also turned his little blue house upside-down. Can he tame this wild creature of lust before the God of the Moon and the Hunt destroys everything Colt holds dear?\n\nDisclaimer: Rage King - Book Two is a steamy, rather slow-burn urban fantasy adventure that has the MC creating a harem to control the god of rage possessing him. The sex scenes are explicit. Welcome to a rich, brand-new world from Aaron Crash, the bestselling author of the American Dragons and the Princesses of the Ironbound series.\nRead more",
    "image": "",
    "series": {
      "name": "Rage King",
      "slug": "rage-king",
      "order": 2
    },
    "format": {
      "ebook": {
        "url": "https://a.co/d/9YOgNpN",
        "createDate": "2022-07-19T18:30:00.000Z"
      },
      "PRINT_BOOK_PAPER_BACK": {
        "url": "https://a.co/d/g4qswRF",
        "createDate": "2022-07-15T18:30:00.000Z"
      },
      "audiobook": {
        "url": "https://a.co/d/1QnyVJj",
        "createDate": "2022-11-29T18:30:00.000Z"
      }
    }
  },
  {
    "bookId": 11,
    "title": "Rage King - Book Three: An Urban Fantasy Men's Adventure",
    "description": "Dracula has come to the Rocky Mountains, and his favorite food is fairy blood...\nColt Holliday is loving his life as the god of rage. His little blue house is packed with women—a vampire, a werewolf, the goddess of lust, and a pit bull named Pickles. But there's always room for one more!\n\nWhen a sexy FoodWheel driver runs into his house seeking sanctuary, Colt finds himself in the middle of an ancient war between the Umbra Alliance, sworn to protect the Monstraverse, and the Brightest Light, who wants nothing more than to kill all monsters. That includes the mysterious Dracula, who just might be behind Colt's becoming a god in the first place.\nIn the final confrontation, all questions will be answered, all foes will be vanquished, and Colt will finally be able to rule his kingdom and pet his dog in peace.\n\nDisclaimer: Rage King is a steamy, rather slow-burn urban fantasy adventure that has the MC creating a harem to control the god of rage possessing him. The sex scenes are explicit. Welcome to a rich, brand-new world from Aaron Crash, the bestselling author of the American Dragons and the Princesses of the Ironbound series.\nRead more",
    "image": "",
    "series": {
      "name": "Rage King",
      "slug": "rage-king",
      "order": 3
    },
    "format": {
      "ebook": {
        "url": "https://a.co/d/dTohGj0",
        "createDate": "2022-10-18T18:30:00.000Z"
      },
      "PRINT_BOOK_PAPER_BACK": {
        "url": "https://a.co/d/8sFevZ7",
        "createDate": "2022-10-17T18:30:00.000Z"
      }
    }
  },
  {
    "bookId": 12,
    "title": "Barbarian Outcast",
    "description": "The lands to the South are full of depraved women driven mad by forbidden sorcery. Now that sounds like fun for a barbarian from the Black Wolf Clan.\n\nThe barbarians of the frozen north live to fight, drink, hunt, and screw, and Ymir is a true son of the Ax Tundra, until a demon curses him with magic. Orphaned by battle and banished by his tribe, Ymir heads south to Old Ironbound, a university where the rich and well-connected learn to master magic. Will Ymir's traditions and pride lead him to failure? Or will the centuries of knowledge—and the lusty human, elven, orcish, and dwarven noblewomen—give him limitless power?\n\nEither way, while his days are all about studying and scheming, his nights are filled with wild sex in the beds of beautiful women. Because in the lands of the South, there are few men, and those Southern women have needs.\n\nDisclaimer: Barbarian Outcast is a steamy slice-of-life harem adventure in a magic university on another world. The sex scenes are explicit but don't get in the way of the story as it slowly unfolds. Enter a brand-new world from Aaron Crash, the bestselling author of the American Dragon series.",
    "image": "",
    "series": {
      "name": "Princesses of the Ironbound",
      "slug": "princesses-of-the-ironbound",
      "order": 1
    },
    "format": {
      "ebook": {
        "url": "https://a.co/d/9VZ04nw",
        "createDate": "2020-01-21T18:30:00.000Z"
      },
      "PRINT_BOOK_PAPER_BACK": {
        "url": "https://a.co/d/csBw8EL",
        "createDate": "2020-02-17T18:30:00.000Z"
      },
      "audiobook": {
        "url": "https://a.co/d/0ze3j6Y",
        "createDate": "2020-04-21T18:30:00.000Z"
      }
    }
  },
  {
    "bookId": 13,
    "title": "Barbarian Assassin",
    "description": "There's something new, dark, and sweet at Old Ironbound\n\nYmir made a vow to master magic and to take care of his women. To do that, he'll stay at the Majestrial Collegium Universitas, but he'll stay on his own terms. He has a new business idea that will make life at the college sweeter and keep all the scholars randy. Ymir's new business scheme requires a kitchen girl: the flirty dwarf named Toriah Welldeep, whose cheerful smile hides a broken heart.\n\nIt's not all work, though, and he finds love, laughter, and passion with Jennybelle Josen and Lillee Nehenna, though the elf maiden is struggling to come to terms with the short lifespan of her new family, and something is giving Jenny nightmares.\n\nCould it be one of the new professors working at Old Ironbound? The incoming teachers are not what they seem. Is the Midnight Guild coming to finish what they started?\n\nBarbarians don't wait for assassins to murder them in their beds. Barbarians murder first.\n\nDisclaimer: Barbarian Assassin is a steamy slice-of-life harem adventure in a magic university on another world. The story burns slow and hot, as hot as the depraved women in Ymir's life. The sex scenes are explicit. You've been warned. Enter a brand-new world from Aaron Crash, the bestselling author of the American Dragon series.",
    "image": "",
    "series": {
      "name": "Princesses of the Ironbound",
      "slug": "princesses-of-the-ironbound",
      "order": 2
    },
    "format": {
      "ebook": {
        "url": "https://a.co/d/9PGeSkx",
        "createDate": "2020-04-21T18:30:00.000Z"
      },
      "PRINT_BOOK_PAPER_BACK": {
        "url": "https://a.co/d/23hgKl5",
        "createDate": "2020-05-23T18:30:00.000Z"
      },
      "audiobook": {
        "url": "https://a.co/d/4W04c84",
        "createDate": "2020-06-02T18:30:00.000Z"
      }
    }
  },
  {
    "bookId": 14,
    "title": "Barbarian Alchemist",
    "description": "She's a She-Orc on the streets, and a Princess in the sheets…\n\n\nYmir has heard rumors of possible trouble with the merfolk because the fish people are not to be trusted. But everyone's favorite barbarian turned scholar has other things to worry about. He's working on forging another ring, running a business, and studying for his alchemy exams.\n\n\nThe women of Old Ironbound aren't making that easy.\n\n\nThere's a greedy fairy who won't take no for an answer, his dwarven girlfriend is sampling aphrodisiacs, and now Gatha, the she-orc librarian, is showing some interest in him—but only if he can defeat her in battle. Meanwhile, the seas around the Majestrial Collegium Universitas are boiling with trouble. Someone is coming for an ancient artifact inside the Librarium Citadel, and if they get it, the continent of Thera will never be the same again.\n\nDisclaimer: Barbarian Alchemist is a steamy slice-of-life harem adventure in a magic university on another world. The story burns slow and hot, as hot as the depraved women in Ymir's life. The sex scenes are explicit. You've been warned. Enter a brand-new world from Aaron Crash, the bestselling author of the American Dragon series.",
    "image": "",
    "series": {
      "name": "Princesses of the Ironbound",
      "slug": "princesses-of-the-ironbound",
      "order": 3
    },
    "format": {
      "ebook": {
        "url": "https://a.co/d/2QHXcSD",
        "createDate": "2020-06-02T18:30:00.000Z"
      },
      "PRINT_BOOK_PAPER_BACK": {
        "url": "https://a.co/d/0TqkkU7",
        "createDate": "2020-06-05T18:30:00.000Z"
      },
      "audiobook": {
        "url": "https://a.co/d/7uONqED",
        "createDate": "2020-12-22T18:30:00.000Z"
      }
    }
  },
  {
    "bookId": 15,
    "title": "Barbarian Gladiator",
    "description": "Gulnash the Betrayer is coming to Old Ironbound, and he's coming for blood!\n\nYmir just wanted to finish his second year, craft the next Akkiric Ring, and enjoy the summer in the company of his beautiful women. But Old Ironbound has been chosen as the location of the orc blood games, and all the ruling families of the surrounding kingdoms have come to make sure the worst scourge of the Blood Steppes, Gulnash, loses his life on the pit sands. If Ymir can win the day, the three major cities of the Blood Steppes are his by right.\n\nBut Ymir's summer isn't all just about rogue orcs. A woman, long dead, haunts the halls, filled with a lust that defies imagination. A damaged mermaid princess is causing trouble, but this time, it's sexy trouble. And the leaders of the Midnight Guild finally reveal themselves…and strike!\n\nYmir has never faced bigger challenges, and he'll have to brave new enemies and find new allies in a battle royale that will be both bloodier and more erotic than ever before.\n\nDisclaimer: Barbarian Gladiator is a steamy slice-of-life harem adventure in a magic university on another world. The story burns slow and hot, as hot as the depraved women in Ymir's life. The sex scenes are explicit. You've been warned. Enter a brand-new world from Aaron Crash, the bestselling author of the American Dragon series.\n",
    "image": "",
    "series": {
      "name": "Princesses of the Ironbound",
      "slug": "princesses-of-the-ironbound",
      "order": 4
    },
    "format": {
      "ebook": {
        "url": "https://a.co/d/hBGzxCf",
        "createDate": "2020-11-05T18:30:00.000Z"
      },
      "PRINT_BOOK_PAPER_BACK": {
        "url": "https://a.co/d/2Iy2I7a",
        "createDate": "2020-11-23T18:30:00.000Z"
      },
      "audiobook": {
        "url": "https://a.co/d/8vNJ04f",
        "createDate": "2021-02-16T18:30:00.000Z"
      }
    }
  },
  {
    "bookId": 16,
    "title": "Barbarian Dragonslayer",
    "description": "An ancient evil has come to Old Ironbound—is it a dragon or is it something else?\n\n\nYmir has obtained six of the eight Akkiric rings—the rings that allowed Aegel Akkridor and his wives to live for a thousand years—but the more he studies, the closer he comes to learning the secret behind the great vempor's death.\n\n\nA secret that may mean death for Ymir and his wives as well.\n\n\nWith a murder in Four Roads, his supply of xoca beans gone, new information about the Fayee, a demon king on the march, and rumors of a dragon, Ymir barely has time to please his women and flirt with the Princept of the school. Are these distractions from the destruction to come, or will Ymir need all the help he can get to face the darkness descending on Old Ironbound?\n\nDisclaimer: Barbarian Dragonslayer is a steamy slice-of-life harem adventure in a magic university on another world. The sex scenes are explicit but don't get in the way of the story as it slowly unfolds. Enter a dark fantasy world from the mind of Aaron Crash, the bestselling author of the American Dragon series.\n",
    "image": "",
    "series": {
      "name": "Princesses of the Ironbound",
      "slug": "princesses-of-the-ironbound",
      "order": 5
    },
    "format": {
      "ebook": {
        "url": "https://a.co/d/5UCMzGC",
        "createDate": "2021-07-20T18:30:00.000Z"
      },
      "PRINT_BOOK_PAPER_BACK": {
        "url": "https://a.co/d/9BIbsdx",
        "createDate": "2021-08-05T18:30:00.000Z"
      },
      "audiobook": {
        "url": "https://a.co/d/754SkuS",
        "createDate": "2021-09-07T18:30:00.000Z "
      }
    }
  },
  {
    "bookId": 17,
    "title": "Barbarian Conqueror",
    "description": "The One Last Ring Might Be One Ring Too Many…\n\nYmir now has six beautiful wives, seven Akkiric Rings, and only a year left before he graduates from Old Ironbound—if war doesn't kill them all first. The demon king from the southern continent has come to conquer Thera, but there's a new winged warrior at the school who might have the secret to stopping him.\n\nAnd that secret includes forging the last magical ring. Delving into forbidden texts, dabbling in alchemical necromancy, and uncovering the obscure history of an ancient deathless emperor, Ymir and his wives have never been closer to understanding the true nature of the Lonely Man's curse.\n\nTo finish his journey, the barbarian cursed by magic will need more potions, more wives, and one final, delicious encounter the whole harem has been waiting for. One thing is for sure—demons or not, Ymir won't stop until he has conquered the world.\n\nDisclaimer: Barbarian Conqueror is a steamy slice-of-life harem adventure in a magic university on another world. The sex scenes are explicit but don't get in the way of the story as it slowly unfolds. Enter a dark fantasy world from the mind of Aaron Crash, the bestselling author of the American Dragon series.",
    "image": "",
    "series": {
      "name": "Princesses of the Ironbound",
      "slug": "princesses-of-the-ironbound",
      "order": 6
    },
    "format": {
      "ebook": {
        "url": "https://a.co/d/3rS74AH",
        "createDate": "2022-02-22T18:30:00.000Z"
      },
      "PRINT_BOOK_PAPER_BACK": {
        "url": "https://a.co/d/5sKHNzj",
        "createDate": "2022-02-17T18:30:00.000Z"
      },
      "audiobook": {
        "url": "https://a.co/d/98GdWuZ",
        "createDate": "2022-03-21T18:30:00.000Z"
      }
    }
  },
  {
    "bookId": 19,
    "title": "Masters of Reality - Book One",
    "description": "A Mysterious Island. Unbridled Lust. The Adventure of a Lifetime.\nAfter ten years together, Jeremy “Jem” Creed and his wife, Crystal, are looking to give their marriage a fresh start on Paradeisos, a mysterious island off the coast of Oregon. What they find is stranger than they could have imagined: the locals are named after Greek gods, horned thugs lurk in back alleys, and the women are strangely friendly.\n\nAn anonymous message from something called Erebos opens Jem's life to new possibilities, including a local rock star named Ruby Inke. But Ruby comes with secrets that make her as dangerous as she is beautiful.\nCan Jem and Crystal unravel the mysteries on the island before they find themselves lost in paradise?\n\nDisclaimer: Masters of Reality is a steamy harem mystery/adventure that has the MC and his wife bringing another woman into their marriage. The sex scenes are explicit. Welcome to a unique experience from Aaron Crash, the bestselling author of the American Dragons and the Princesses of the Ironbound series.\nRead more",
    "image": "",
    "series": {
      "name": "Masters of Reality",
      "slug": "masters-of-reality",
      "order": 1
    },
    "format": {
      "ebook": {
        "url": "https://a.co/d/hX89m7P",
        "createDate": "2023-01-01T18:30:00.000Z"
      },
      "PRINT_BOOK_PAPER_BACK": {
        "url": "https://a.co/d/ixd1DTw",
        "createDate": "2023-01-02T18:30:00.000Z"
      },
      "audiobook": {
        "url": "https://a.co/d/aybqAqS",
        "createDate": "2023-01-03T18:30:00.000Z"
      }
    }
  },
  {
    "bookId": 20,
    "title": "Masters of Reality - Book Two",
    "description": "Reality is the Greatest Game, and It's Winner Take All!\n\nJem, Crystal, and Ruby are back on Paradeisos Island. This time, they have software that can give them anything they want, the monsters aren't hiding, and there is a new mystery—Elsie Dorrance, a beautiful heiress, is missing, and someone called the Queen of Chains seems to have taken her.\n\nTo find Elsie, they'll journey to FarWind, a fantasy world rich with adventure and intrigue. There will be music, laughter, and even a dragon to slay. Plus, there's a queen who might be evil, and an emperor who holds life and death in the palm of his hand.\n\nCan they rescue Elsie and escape the evil emperor's clutches? Can they decipher Mr. Oregon's mysterious messages? Will a simple song reveal the truth of the Erebos Experience?\nJoin Jem and his wives on an epic quest to become…Masters of Reality.\n\nDisclaimer: Masters of Reality is a steamy harem mystery/adventure that features scenes that are of an adult nature. No fading to black. No closed doors. Nothing but sexy fun. Welcome to a mind-bending experience from Aaron Crash, the bestselling author of the American Dragons and the Princesses of the Ironbound series.",
    "image": "",
    "series": {
      "name": "Masters of Reality",
      "slug": "masters-of-reality",
      "order": 2
    },
    "format": {
      "ebook": {
        "url": "https://a.co/d/dI9cCEI",
        "createDate": "2023-05-09T18:30:00.000Z"
      },
      "PRINT_BOOK_PAPER_BACK": {
        "url": "https://a.co/d/j1WsuS5",
        "createDate": "2023-05-06T18:30:00.000Z"
      },
      "audiobook": {
        "url": "https://a.co/d/9aDcInI",
        "createDate": "2023-05-09T18:30:00.000Z"
      }
    }
  },
  {
    "bookId": 21,
    "title": "Masters of Reality - Book Three",
    "description": "The truth shall set you free…but first you've got to fight for it.\n\nJem, Crystal, and Ruby have found themselves trapped in a world that may or may not be real. However, one thing is clear—their music is the key to unlocking the secrets that keep them captive in a reality beyond their understanding.\n\nBack on Paradeisos Island, there's a new building—the Temple of the Morning Sun—but it's locked up tight. To get inside, Jem and his wives will have to journey to distant galaxies, fight killer insect aliens, and try to find a lost starship beyond the edge of the universe.\n\nHearts will be broken but souls will be saved as Jem finally understands what the Erebos Experience has been trying to tell him all along.\n\nLife is the ultimate adventure, and Jem and his wives are destined to become…Masters of Reality.\n\nDisclaimer: Masters of Reality is a steamy harem mystery/adventure that features scenes of an adult nature. No fading to black. No closed doors. Nothing but sexy fun. Welcome to a mind-bending experience from Aaron Crash, the bestselling author of the American Dragons and the Princesses of the Ironbound series.\nRead more",
    "image": "",
    "series": {
      "name": "Masters of Reality",
      "slug": "masters-of-reality",
      "order": 3
    },
    "format": {
      "ebook": {
        "url": "https://a.co/d/gqiDSkv",
        "createDate": "2023-10-03T18:30:00.000Z"
      },
      "PRINT_BOOK_PAPER_BACK": {
        "url": "https://a.co/d/h5XeMH7",
        "createDate": "2024-01-07T18:30:00.000Z"
      },
      "audiobook": {
        "url": "https://a.co/d/eKY53sv",
        "createDate": "2024-03-19T18:30:00.000Z"
      }
    }
  },
  {
    "bookId": 22,
    "title": "Raider Annihilation",
    "description": "He's No Angel, But He's Got Everything She Needs\n\n\nHe was minding his own business on Earth when a beautiful sorceress summoned him to defend a backwater village from demonic raiders. He's lost his gun, his family, and even his name, but it's not the first fight he's been in, and it won't be the last.\n\nThe sorceress isn't happy—she expected an ancient goddess of war. Instead, she got some random guy who's halfway decent with a sword. But there's more to him than good looks and a big stick, and if he can harness this new world's magic, the town of Foulwater might just be glad he stuck around.\n\nFirst, though, he'll have to get a busty elf buccaneer to sober up, sail through monster-infested waters, kick a bunch of lava monsters in the face, and plunder the submerged basement of a demon king. It's a race against time before the raiders return to burn down the village, and their deadliest enemy might already be inside the walls.\n\n\nDisclaimer: Raider Annihilation is a steamy isekai harem adventure like no other. Our hero isn't shy and neither are the women of Caranja. There is sex on the page, swearing, smoking, drug use, and goat-milk beer. Enter a spicy new world from Aaron Crash, the bestselling author of the American Dragon series and The Princesses of the Ironbound.\n",
    "image": "",
    "series": {
      "name": "Son of Fire",
      "slug": "son-of-fire",
      "order": 1
    },
    "format": {
      "ebook": {
        "url": "https://a.co/d/7446SoA",
        "createDate": "2020-03-17T18:30:00.000Z"
      },
      "PRINT_BOOK_PAPER_BACK": {
        "url": "https://a.co/d/gyQNqPU",
        "createDate": "2020-05-10T18:30:00.000Z"
      },
      "audiobook": {
        "url": "https://a.co/d/dKK3BwC",
        "createDate": "2020-06-29T18:30:00.000Z"
      }
    }
  },
  {
    "bookId": 23,
    "title": "Kraken Killjoy",
    "description": "A new wave of tentacled terror is heading for Foulwater.\n\nAxel is homesick. Yes, exploring a strange new world, discovering new powers, and slaying monsters is all awesomely fun. However, he misses his family, nachos, and whiskey that doesn't taste like tree fungus.\n\nThen the kraken attack, led by an army of monstrous mermen who are out for vengeance. Or are they? There are secrets in Foulwater Bay that the merfolk will kill for. Axel must bring in new spells, new weapons, and new allies to stop the fin lickers and to take another important step in getting home.\n\nAll in the normal day of an isekai hero.\n\nOnly, there's an angelic woman that might ruin everything. Damn, but it seems trouble has wings.\n\nDisclaimer: Kraken Killjoy is a steamy isekai harem adventure like no other. Our hero isn't shy, and neither are the women of Caranja. There is sex on the page, swearing, smoking, drug use, and goat-milk beer. Enter a spicy new world from Aaron Crash, the bestselling author of American Dragons and the Princesses of the Ironbound.",
    "image": "",
    "series": {
      "name": "Son of Fire",
      "slug": "son-of-fire",
      "order": 2
    },
    "format": {
      "ebook": {
        "url": "https://a.co/d/hOPBoCR",
        "createDate": "2020-07-14T18:30:00.000Z"
      },
      "PRINT_BOOK_PAPER_BACK": {
        "url": "https://a.co/d/gaaWrh5",
        "createDate": "2020-07-20T18:30:00.000Z"
      }
    }
  },
  {
    "bookId": 24,
    "title": "Demon Lord Destruction",
    "description": "For the Son of Fire, Quests Lead to Wars and Wars Lead to Games\n\nAxel Drokharis, the son of the legendary Dragonsoul Steven Drokharis, has made a home for himself on the world of Caranja. Things are good and it's all just fried centipede shrimp and goat milk beer until the Hell Machine of the ancient demon kings starts rolling toward Axel's hometown of Foulwater.\n\nIt's up to Axel and his Escort of beautiful women—Figg, Rhee, Dryx, and Broom—to stop the machine from popping out legions of flesh-hungry demon babies and destroying Foulwater forever.\n\nThis is the exciting conclusion to the Son of Fire trilogy, where all your questions will be answered: Why was Axel sent to Caranja? Who is Eggero Khel? Who is the mysterious American Dragon out in the desert? And what does a guy have to do around here to get some nachos?\n\nDisclaimer: Demon Lord Destruction is a steamy Isekai harem adventure like no other. Our hero isn't shy, and neither are the women of Caranja. There is sex on the page, swearing, smoking, drug use, and goat-milk beer. Enter a spicy new world from Aaron Crash, the bestselling author of American Dragon and The Princesses of the Ironbound.",
    "image": "",
    "series": {
      "name": "Son of Fire",
      "slug": "son-of-fire",
      "order": 3
    },
    "format": {
      "ebook": {
        "url": "https://a.co/d/cWjfrcm",
        "createDate": "2024-10-08T18:30:00.000Z"
      },
      "PRINT_BOOK_PAPER_BACK": {
        "url": "https://a.co/d/1MFhEfk",
        "createDate": "2024-10-05T18:30:00.000Z"
      }
    }
  },
  {
    "bookId": 25,
    "title": "Denver Fury",
    "description": "Gather an escort. Acquire a dragon hoard. Build an empire....\n\nSteven Whipp, a normal, poor college student, is kissed and shot on the night of his 20th birthday. He realizes three things: He's bulletproof; he's a dragon; and everything he's ever wanted is within his reach. But the attempts on his life are just the beginning of his troubles.\n\nSteven is a Dragonsoul - a magical race of beings who have thrived, hidden from the eyes of humans, in control of the world. And not just any Dragonsoul but the last in a long line of Arch-Sorcerers, thought long dead. Now he is being hunted, and he must unlock his powers through battle and sex, or ancient forces and old feuds will destroy him and all he loves.\n\nFrom the author of the LitRPG epic fantasy, War God's Mantle, comes a brand new pulp harem adventure!\n\nDisclaimer: Denver Fury is a shoot-em-up, action adventure, urban fantasy novel which is not intended for listeners under the age of 18 years of age. This novel contains swearing, violence, and a harem of beautiful shapeshifting women that the hero regularly sleeps with - and he does so gladly.",
    "image": "",
    "series": {
      "name": "American Dragons",
      "slug": "american-dragons",
      "order": 1
    },
    "format": {
      "ebook": {
        "url": "https://a.co/d/2VMpTsd",
        "createDate": "2018-07-17T18:30:00.000Z"
      },
      "PRINT_BOOK_PAPER_BACK": {
        "url": "https://a.co/d/4I3X6r7",
        "createDate": "2018-07-13T18:30:00.000Z"
      },
      "audiobook": {
        "url": "https://a.co/d/i6WS8Kk",
        "createDate": "2018-11-13T18:30:00.000Z"
      }
    }
  },
  {
    "bookId": 26,
    "title": "Cheyenne Magic",
    "description": "Gather an escort. Acquire a dragon hoard. Build an empire …\n\nSteven Drokharis knew that embracing his destiny as one of the most powerful Dragonsouls to ever live would be difficult, but he had no idea that he'd be pushed to his very limits.\n\nTen days after rescuing Aria and ending the life of an insane Dragonskin, Steven and his escort find themselves going toe-to-toe with Rhaegen Mulk—the deadly Dragonsoul responsible for the death of Steven's parents. And Rhaegen Mulk doesn't fight fair. He will pull out all the stops to end Steven before he can grow his escort and establish a primacy of his own. If Steven is going to win, he'll need to level up his skills as a Dragonsoul, discover the next volume of forbidden Drokharis magic, and make friends with an ancient, half-mad Dragonsoul, who may be even more dangerous than Mulk.\n\nNow it's time to hit back. Hard. Mulk and his lackeys are about to learn an important lesson: Steven doesn't fight fair either …\n\nDisclaimer: Cheyenne Magic (American Dragons Book 2) is a plup, shoot-em-up, action adventure, urban fantasy novel which is not intended for readers under the age of 18. This novel contains swearing, violence, and a harem of beautiful shapeshifting women that the hero regularly sleeps with—and he does so gladly.\nRead more",
    "image": "",
    "series": {
      "name": "American Dragons",
      "slug": "american-dragons",
      "order": 2
    },
    "format": {
      "ebook": {
        "url": "https://a.co/d/cjdDcZw",
        "createDate": "2018-08-28T18:30:00.000Z"
      },
      "PRINT_BOOK_PAPER_BACK": {
        "url": "https://a.co/d/48YVj7A",
        "createDate": "2018-10-24T18:30:00.000Z"
      },
      "audiobook": {
        "url": "https://a.co/d/hJuXT2O",
        "createDate": "2018-12-26T18:30:00.000Z"
      }
    }
  },
  {
    "bookId": 27,
    "title": "Montana Firestorm",
    "description": "Gather an escort. Acquire a dragon hoard. Build an empire …Steven Drokharis finally has his own Primacy, and he will stop at nothing to defend it.Luckily, Steven has a new Magician in his Escort, and she's as beautiful as she is powerful. And yet, they are still on a journey of vengeance: his now dead enemy, Rhaegen Mulk, wasn't working alone. At the same time, Mouse wants her own form of vengeance against the Prime who now rules the Rocky Mountains. That's a whole lotta hate, and Steven and his Escort need to unlock the forbidden magic in the third volume of the Drokharis Grimoire if they hope to stand against a world of dragons trying to destroy them.Disclaimer: Montana Firestorm (American Dragons Book 3) is a shoot-em-up, action adventure, urban fantasy novel which is not intended for readers under the age of 18. This novel contains swearing, violence, and a harem of beautiful shapeshifting women that the hero regularly sleeps with—and he does so gladly.\nRead more",
    "image": "",
    "series": {
      "name": "American Dragons",
      "slug": "american-dragons",
      "order": 3
    },
    "format": {
      "ebook": {
        "url": "https://a.co/d/7x5AJZQ",
        "createDate": "2018-11-06T18:30:00.000Z"
      },
      "PRINT_BOOK_PAPER_BACK": {
        "url": "https://a.co/d/aOnqKwR",
        "createDate": "2018-12-04T18:30:00.000Z"
      },
      "audiobook": {
        "url": "https://a.co/d/cCzi0Y5",
        "createDate": "2019-03-01T18:30:00.000Z"
      }
    }
  },
  {
    "bookId": 28,
    "title": "Texas Showdown",
    "description": "Winning an empire was the easy part. Keeping it will be harder.\n\nAfter killing Rahaab, the most powerful dragon on Earth, Steven Drokharis knew he'd have to fight to keep what he'd won, but the cabal that killed his father was just the tip of the iceberg. He'll have to fend off a cult of shapeshifters, magical constructs, and two devious, busty, machine-gun-toting twins, all while keeping his Escort of human and dragon women satisfied. Meanwhile, the eyes of ancient demons are ever searching for signs of dragons, and the deadliest threat may be close to home.\n\nDisclaimer: Texas Showdown (American Dragons Book 4) is a shoot-em-up, action adventure, urban fantasy novel which is not intended for readers under the age of 18. This novel contains swearing, violence, and a harem of beautiful shapeshifting women that the hero regularly sleeps with—and he does so gladly.\nRead more",
    "image": "",
    "series": {
      "name": "American Dragons",
      "slug": "american-dragons",
      "order": 4
    },
    "format": {
      "ebook": {
        "url": "https://a.co/d/c3wviCL",
        "createDate": "2018-12-18T18:30:00.000Z"
      },
      "PRINT_BOOK_PAPER_BACK": {
        "url": "https://a.co/d/eopFPGa",
        "createDate": "2019-02-15T18:30:00.000Z"
      },
      "audiobook": {
        "url": "https://a.co/d/77G8gzU",
        "createDate": "2019-07-30T18:30:00.000Z"
      }
    }
  },
  {
    "bookId": 29,
    "title": "California Imperium",
    "description": "They want it all, and they want it right now.\n\nSteven Drokharis has built an empire that stretches across the United States and around the world. He seems unstoppable—a force of nature and a creature of wrath.\n\nBut now, he'll have to deal with something deadlier than enemies … Dragonsoul allies. Exiled from America and on the run, Steven and his escort of beautiful women will have to unravel the secrets of the past to save their future.\n\nFriends will become enemies, enemies friends, and century-old feuds will bleed anew in this fifth exciting installment of the bestselling American Dragons series.\n\nFrom Aaron Crash, the bestselling Author of War God's Mantle, comes the fifth installment in the epic American Dragons series!\n\n\nDisclaimer: California Imperium (American Dragons Book 5) is a shoot-em-up, action adventure, urban fantasy novel which is not intended for readers under the age of 18. This novel contains swearing, violence, and a harem of beautiful shapeshifting women that the hero regularly sleeps with—and he does so gladly.\n",
    "image": "",
    "series": {
      "name": "American Dragons",
      "slug": "american-dragons",
      "order": 5
    },
    "format": {
      "ebook": {
        "url": "https://a.co/d/2FI6nuu",
        "createDate": "2019-03-21T18:30:00.000Z"
      },
      "PRINT_BOOK_PAPER_BACK": {
        "url": "https://a.co/d/3FdHMGD",
        "createDate": "2019-06-24T18:30:00.000Z"
      },
      "audiobook": {
        "url": "https://a.co/d/2QQcqM0",
        "createDate": "2019-11-12T18:30:00.000Z"
      }
    }
  },
  {
    "bookId": 30,
    "title": "Dodge City Knights",
    "description": "WHEN LEGENDS LIVE, DRAGONS DIE.\n\nSteven Drokharis is on an impossible quest to find the Holy Grail. The Dragonknights came close, but then their ranks were decimated by the mysterious Dragon Slayer, a legend that still fills Primes with terror. Standing in Steven's way are ancient forces that have been waiting for the Lost Son and Merlin's Daughter to continue the hunt. And yet, war has come to Steven's doorstep, and he must balance defending what he's earned with his greater ambition of bringing revolution to Dragonsouls everywhere.\n\nOnce again, Steven must gather his allies while his enemies across the world conspire to destroy him. And the greatest villain might be in his own ranks. Tessa stands on the razor's edge of good and evil, tempted. Can Steven and the beautiful women of his Escort save her very soul?\n\nOr will Tessa murder the last of the Dragonknights before Steven can unearth the ultimate weapon?\n\nDisclaimer: Dodge City Knights (American Dragons Book 6) is a shoot-em-up, action adventure, urban fantasy novel which is not intended for readers under the age of 18. This novel contains swearing, violence, and a harem of beautiful shapeshifting women that the hero regularly sleeps with—and he does so gladly.",
    "image": "",
    "series": {
      "name": "American Dragons",
      "slug": "american-dragons",
      "order": 6
    },
    "format": {
      "ebook": {
        "url": "https://a.co/d/hXQBBYz",
        "createDate": "2019-05-14T18:30:00.000Z"
      },
      "PRINT_BOOK_PAPER_BACK": {
        "url": "https://a.co/d/gfPgPrL",
        "createDate": "2019-09-30T18:30:00.000Z"
      },
      "audiobook": {
        "url": "https://a.co/d/212Nnvg",
        "createDate": "2020-05-15T18:30:00.000Z"
      }
    }
  },
  {
    "bookId": 31,
    "title": "Leadville Crucible",
    "description": "ON A WORLD SCOURED BY DEMONS, EVEN DRAGONS ARE PREY.\n\nGaia Alpha is safe under Steven's rule. He's secured his borders, made allies of the remaining Dragonsoul Primes, and retrieved Icharaam's Gift, the fabled Holy Grail.\n\nBut Steven's war is bigger than one world. On Gaia Beta, the Battle World, Spider Finger and the Zothoric are gathering, and if they find a path to Steven's home, everything he's fought to save will be swallowed in the Great Devouring.\n\nIt's time to take the fight to the shadows on a road trip between universes. Only this time, it may be a battle too big for Steven to win.\n\nDisclaimer: Leadville Crucible (American Dragons Book 7) is a shoot-em-up, action adventure, urban fantasy novel which is not intended for readers under the age of 18. This novel contains swearing, violence, and a harem of beautiful shapeshifting women that the hero regularly sleeps with—and he does so gladly.",
    "image": "",
    "series": {
      "name": "American Dragons",
      "slug": "american-dragons",
      "order": 7
    },
    "format": {
      "ebook": {
        "url": "https://a.co/d/euohs1F",
        "createDate": "2019-07-16T18:30:00.000Z"
      },
      "PRINT_BOOK_PAPER_BACK": {
        "url": "https://a.co/d/dlD4ZQv",
        "createDate": "2019-11-17T18:30:00.000Z"
      },
      "audiobook": {
        "url": "https://a.co/d/8aP4YzA",
        "createDate": "2020-08-10T18:30:00.000Z"
      }
    }
  },
  {
    "bookId": 32,
    "title": "Alaska Kingdom",
    "description": "To win one world, he'll have to journey to another…\n\nSteven Drokharis has done well to survive on Battle World, a planet designed to murder him and everyone he loves. In order to defeat the Zothoric, he needs both an ancient artifact and an army of allies on a distant world. With the help of the mysterious Shadow Archer, he'll find himself on a quest that strains the limits of his imagination. It certainly isn't going to be easy on Chastity and Prudence Wayne—the Texas machine-gun twins never signed on to search for lost elves. Good thing Mouse is there to provide the sarcasm, and Uchiko the arrows.\n\nHunted by old foes and new, Steven and his Escort will be tested in every way possible. All the while, the Demon Queen Zothora inches closer, preparing to snap close her diabolical trap.\n\n\nDisclaimer: Alaska Kingdom (American Dragons Book 8) is a shoot-em-up, action adventure, urban fantasy novel which is not intended for readers under the age of 18. This novel contains swearing, violence, and a harem of beautiful shapeshifting women that the hero regularly sleeps with—and he does so gladly.\n",
    "image": "",
    "series": {
      "name": "American Dragons",
      "slug": "american-dragons",
      "order": 8
    },
    "format": {
      "ebook": {
        "url": "https://a.co/d/ab5KWCo",
        "createDate": "2019-10-15T18:30:00.000Z"
      },
      "PRINT_BOOK_PAPER_BACK": {
        "url": "https://a.co/d/fDdGYeG",
        "createDate": "2020-01-19T18:30:00.000Z"
      },
      "audiobook": {
        "url": "https://a.co/d/0ytWwAD",
        "createDate": "2022-07-05T18:30:00.000Z"
      }
    }
  },
  {
    "bookId": 33,
    "title": "Alamosa Arena",
    "description": "Come Into My Parlor Said The Spider To The Dragon.\n\n\nSteven Drokharis has unraveled the secrets of the Dragonknights, journeyed to strange worlds, and gathered an ancient race of warriors… all to face the Zothoric, and their mistress, the Horror Mother. Now, he waits for the final battle. Many have tried before and failed, including alternate versions of himself. Is this the culmination of his plans, or his last chance to run?\n\n\nAnd what about Tara Heridan? The half-turned Prosha hears the Utereich's whispers in her dreams, and they feel darkly delicious. Will love bring her back, or will she betray Steven and embrace an eternity of hunger?\n\n\nWith new allies and old enemies assembled, Steven can feel the end approaching. His own Morta core thrums with the dark queen's approach. Who is he willing to sacrifice for victory? The power he needs to win may cost him everything.\n\n\nAll of reality hangs in the balance in the final chapter of the Zothoric Wars.",
    "image": "",
    "series": {
      "name": "American Dragons",
      "slug": "american-dragons",
      "order": 9
    },
    "format": {
      "ebook": {
        "url": "https://a.co/d/ekELJWK",
        "createDate": "2019-11-26T18:30:00.000Z"
      },
      "PRINT_BOOK_PAPER_BACK": {
        "url": "https://a.co/d/3STVNV9",
        "createDate": "2020-02-03T18:30:00.000Z"
      }
    }
  },
  {
    "bookId": 34,
    "title": "Wyoming Dynasty",
    "description": "Something lost has woken up, and now it wants to play.\n\n\nSteven's daddy was a gambler, or at least that's what Steven thought until he discovered his true heritage. After fighting first to survive, then to conquer on every continent and several worlds, Steven has gathered his Escort, acquired a dragon hoard, and built an empire. But there are greater forces at work in the universe than dragons and demons, and it's Steven's bad luck that one of those elder things has come looking for him.\n\nBacked by the indomitable Tessa, fiery Aria, the insatiable Quinnestri, and the rest of his wives, Steven has one more hand to play before it's all over. The stakes are high. Reggie, his daughter, is starting to show her true power. Dragonkin have scattered across the galaxy and, on Earth, they are about to usher in a new age of prosperity, peace, and free love. It all rests on a card game in a place that doesn't exist, and if Steven isn't careful, he could take out all of reality with him.\n\nBut like Joe Whipp always said, it's only worth playing if you've got skin in the game.\n\nFrom the Aaron Crash, bestselling author of the LitRPG epic fantasy, War God's Mantle, comes the FINAL installment in the American Dragons Saga!\n\n\nDisclaimer: Wyoming Dynasty is a shoot-em-up, action adventure, urban fantasy novel which is not intended for listeners under the age of 18 years of age. This novel contains swearing, violence, and a harem of beautiful shapeshifting women that the hero regularly sleeps with—and he does so gladly.",
    "image": "",
    "series": {
      "name": "American Dragons",
      "slug": "american-dragons",
      "order": 10
    },
    "format": {
      "ebook": {
        "url": "https://a.co/d/bX2slHC",
        "createDate": "2020-02-18T18:30:00.000Z"
      },
      "PRINT_BOOK_PAPER_BACK": {
        "url": "https://a.co/d/hfPAE5K",
        "createDate": "2020-09-09T18:30:00.000Z"
      }
    }
  },
  {
    "bookId": 35,
    "title": "Seattle Storms",
    "description": "Outside of time and space, the Heretic is watching. And waiting…for the perfect time to strike.\n\nSteven Drokharis has vanquished the ultimate evil in the galaxy and now looks forward to a peaceful life with his wives and family. With two new babies to care for, there are plenty of diapers to change and countless sleepless nights ahead. Everything seems fine...\n\nBut a mysterious presence has been watching him, sending enemies his way, attempting to disrupt the peace and prosperity he aims to bring to the universe.\n\nThis is a different kind of adventure, focusing on the quieter moments as Steven navigates the realities of fatherhood and being one of the most powerful beings in existence. What is life like in a household full of women when all your really powerful enemies have been defeated?\n\nDisclaimer: All the American Dragons novels are action-packed, urban fantasy adventures intended for readers over the age of 18. The novels contain swearing, violence, and a harem of beautiful shapeshifting women the hero regularly sleeps with—and he does so gladly.",
    "image": "",
    "series": {
      "name": "American Dragons",
      "slug": "american-dragons",
      "order": 11
    },
    "format": {
      "ebook": {
        "url": "https://a.co/d/iKHuEuP",
        "createDate": "2024-07-23T18:30:00.000Z"
      },
      "PRINT_BOOK_PAPER_BACK": {
        "url": "https://a.co/d/5DUWlch",
        "createDate": "2024-07-19T18:30:00.000Z"
      }
    }
  }
]
