[
  {
    "bookId": 1,
    "title": "Robot Bangarang",
    "description": "Blaze is a highly trained astral marine, fighting demons and saving lives, so he should know better than to bed his latest client. And yet, when she puts a hex on him, suddenly women find him irresistible.<br /><br /> Even his ex-wife is eyeing him, which is a problem, because she's an evil witch. Literally. Together, Blaze and Mara form an uneasy alliance with a misfit crew of aliens and monsters to track down demons, snare ghosts, and destroy hellish creatures bent on murder--all while trying to close the gates of hell forever. There's just one problem. A demon-possessed robot has infiltrated their starship, the Lizzie Borden, and a vicious coven of stellar vampires have stranded them in a graveyard of ships at the edge of known space. All the while, the women on his crew won't leave Blaze alone! From Aaron Crash, author of the American Dragons series and the litRPG epic War God's Mantle, comes a brand new shoot-em-up, action adventure, paranormal space opera you won't want to put down. This novel contains swearing, violence, cyborg vampires, and a harem of beautiful if somewhat inhuman women that the hero regularly sleeps with--when he's not hunting demons.<br /> <br /> Enjoy! A Note from the Author: ROBOT BANGARANG was originally published as DAMNATION ROBOT and what you are about to read is the re-mix. Now, this is important, if you already read DAMNATION ROBOT, you might think twice about this book. There are a lot of similarities. I eased up on some of the horror elements and added some sexy times, so those scenes involve one or more beautiful women, but a lot of the main plot is still the same. Still, if you read and LOVED DR, this will be a variation on something you already like, which can be fun. I hope it's fun because I really liked these books. They didn't quite find their audience, however. Sad face. I'm hoping with a little re-imagining, they'll find readers who like a little spicy in their supernatural space opera. Happy face! Now, if you didn't read DAMNATION ROBOT at all, you're totally fine. I'm Aaron Crash and I approve of this book. I'd like to thank Shadow Alley Press for allowing the re-mix. Also, thanks to Byl Karvetz for being a fan, and all the people who read and left reviews.",
    "image": "robert.jpg",
    "series": {
      "name": "Full Frontal Galaxy",
      "slug": "robot-bangarang",
      "order": 1
    },
    "format": {
      "PRINT_BOOK_PAPER_BACK": {
        "url": "https://a.co/d/gBz4XZ7",
        "createDate": "2019-11-15T05:28:32.686Z"
      },
      "ebook": {
        "url": "https://a.co/d/eQSsMbg",
        "createDate": "2019-06-25T05:28:32.686Z"
      },
      "audiobook": {
        "url": "https://a.co/d/gHjnfpm",
        "createDate": "2020-01-21T05:28:32.686Z"
      }
    }
  },
  {
    "bookId": 2,
    "title": "Space Dragon Boogaloo",
    "description": "More Women, More Ghosts, and More Ancient Evil… A Demon Hunter's Work is Never Done. After defeating the Archduchess of Necrotechnology, Blaze Ramirez and the crew of the Lizzie Bordenare still on the run, wanted dead or alive by the Interstellar Presidential Corporation. Despite their problems with the law, the demon hunters have never been closer to destroying the Onyx Gate and freeing the universe from its evil. However, the one person in the galaxy who might know the location of the gate is trapped on a haunted planet, doomed to die as its two stars collide. And standing between Blaze and the mysterious granny is an army of the walking dead, vicious specters, and beautiful blonde woman with assets Blaze can't ignore. Suddenly, he's grateful for the bad case of succubus herpes Dixie the Demon gave him. From the author of War God's Mantle (a litRPG Adventure) and American Dragons (Harem Gamelit) comes a steamy, action-packed thrill ride that is equal parts Warhammer 40K and Shadowrun, with a healthy dose of sexy to spice up the ride. A Note from the Author: SPACE DRAGON BOOGALOO was originally published as NEUTRON DRAGON ATTACK (Galactic Demon Hunters Book 2) and what you are about to read is the re-mix. Now, this is important, if you already read NEUTRON DRAGON ATTACK, you might think twice about this book. There are a lot of similarities. I eased up on some of the horror elements and added some sexy times, so those scenes involve one or more beautiful women, but a lot of the main plot is still the same. Still, if you read and LOVED NDA, this will be a variation on something you already like, which can be fun. I hope it's fun because I really liked these books. They didn't quite find their audience, however. Sad face. I'm hoping with a little re-imagining, they'll find readers who like a little spicy in their supernatural space opera. Happy face! Now, if you didn't read NEUTRON DRAGON ATTACK at all, you're totally fine. I'm Aaron Crash and I approve of this book.",
    "image": "space-dragon-boogaloo.jpg",
    "series": {
      "name": "Full Frontal Galaxy",
      "slug": "space-dragon-boogaloo",
      "order": 2
    },
    "format": {
      "PRINT_BOOK_PAPER_BACK": {
        "url": "https://a.co/d/2YhdZcf",
        "createDate": "2019-12-01T05:28:32.686Z"
      },
      "ebook": {
        "url": "https://a.co/d/fabGqaW",
        "createDate": "2020-09-22T05:28:32.686Z"
      }
    }
  },
  {
    "bookId": 3,
    "title": "Boss Build: A Monster Girl Adventure",
    "description": "Roy Boss, the CEO of VentureForge Industries, just woke up in a different galaxy. He's lost his company and his body, and the man who murdered him might still be alive. The good news is he's on Plymouth, an almost mythical world where monsters are designed and printed for Roy's game worlds. First order of the day: print himself a superpowered body and get back what's his. But everything is't as it seems. The research lab he arrived in is deserted except for a few dead security guards, and the streets outside are filled with thousands of robot dogs programmed for one single purpose: kill Roy Boss. But Roy has an entire catalog of savior-class monster girls he can print up to help him clean house, each with their own powers, transformations, and fetishes. Hit Print for justice, for satisfaction, and for the love of the game. From Aaron Crash, bestselling author of Barbarian Outcast and the American Dragon series, comes a brand-new world that will leave you turning pages late into the night. Disclaimer: Boss Build is an explicit sci-if harem adventure. There are girls, guns, and sex on the page. Each of Roy's monster girls is fully configurable when it comes to bedroom activities. It's like a smutty I Am Legend meets Westworld. You have been warned.",
    "image": "boss-build-A-monster-girl-adventure.jpg",
    "series": {
      "name": "Creature Girl Creations",
      "slug": "boss-build-A-monster-girl-adventure",
      "order": 1
    },
    "format": {
      "PRINT_BOOK_PAPER_BACK": {
        "url": "https://a.co/d/eqMAE0T",
        "createDate": "2020-10-18T05:28:32.686Z"
      },
      "ebook": {
        "url": "https://a.co/d/2tbBcbF",
        "createDate": "2020-09-22T05:28:32.686Z"
      },
      "audiobook": {
        "url": "https://a.co/d/7e0J0N6",
        "createDate": "2020-12-03T05:28:32.686Z"
      }
    }
  },
  {
    "bookId": 4,
    "title": "Master Build: A Monster Girl Adventure",
    "description": "What lies beneath this planet of mystery? Roy Boss had it made. He had three sexy monster girls and two cute baby girls, and he murdered the hell out of the guy who stole his company. The only thing left to do was to go back through the stargate and take back his property… or at least that's what he thought before the gateway to the planet's underworld swung open. The revelations of the deep dark are astounding: the birth of the Pelerine, the secrets of the Coptics, and the arrival of the UnWolf. But by learning the secret histories, Roy has drawn the attentions of an ancient foe. He'll have to level up, gather more resources, and print his own army of monsters, or the planet of Plymouth will die a second time—and this time, the future of the Milky Way Galaxy might perish with it. From Aaron Crash, bestselling author of Barbarian Outcast and the American Dragon series, comes a brand-new world that will leave you turning pages late into the night. Disclaimer: Master Build is an explicit sci-if harem adventure. There are girls, guns, and sex on the page. Each of Roy's monster girls is fully configurable when it comes to bedroom activities. It's like a smutty I Am Legend meets Westworld. You have been warned.",
    "image": "master-build-a-monster-girl-adventure.jpg",
    "series": {
      "name": "Creature Girl Creations",
      "slug": "master-build-a-monster-girl-adventure",
      "order": 2
    },
    "format": {
      "PRINT_BOOK_PAPER_BACK": {
        "url": "https://a.co/d/1XQp4HM",
        "createDate": "2021-01-06T05:28:32.686Z"
      },
      "ebook": {
        "url": "https://a.co/d/dIM4Ljx",
        "createDate": "2020-12-03T05:28:32.686Z"
      },
      "audiobook": {
        "url": "https://a.co/d/7THrLhd",
        "createDate": "2021-03-09T05:28:32.686Z"
      }
    }
  },
  {
    "bookId": 5,
    "title": "God Build: A Monster Girl Adventure",
    "description": "He's done playing. Now, he's going to win. Roy Boss has the planet of Plymouth all to himself. He's beaten back his enemies in the Milky Way Galaxy and he's destroyed Morcom. Now it's time to get his company back. To do that, he'll need to play a game with a sexy new opponent in space. He'll have to undo her plans, run her dungeons, and get to the Plymouth Gate, where the war is only just beginning. Luckily, Roy has the help of the monster girls he's created, as well as more on the way. He's designed an army to win, but not everything is going so smoothly inside his family. The niddies are growing up and want prey. Suzanne, the sexy snake woman, isn't about to make life easy, and a pregnant Tails is proving that hell hath no fury like a hungry fox girl. Even Halcyon, the insatiable A.I., is having issues. Roy will have to deal with his women and win his way across the galaxies to reclaim what is rightfully his in this epic conclusion of the Creature Girl Creations trilogy. Disclaimer: God Build is an explicit sci-if harem adventure. There are girls, guns, and sex on the page. Each of Roy's monster girls is fully configurable when it comes to bedroom activities. It's like a smutty I Am Legend meets Westworld. You have been warned.",
    "image": "god-build-a-monster-girl-adventure.jpg",
    "series": {
      "name": "Creature Girl Creations",
      "slug": "god-build-a-monster-girl-adventure",
      "order": 3
    },
    "format": {
      "PRINT_BOOK_PAPER_BACK": {
        "url": "https://a.co/d/hqsgmde",
        "createDate": "2021-02-18T05:28:32.686Z"
      },
      "ebook": {
        "url": "https://a.co/d/99U03Zp",
        "createDate": "2021-02-09T05:28:32.686Z"
      }
    }
  },
  {
    "bookId": 6,
    "title": "War God's Mantle: Ascension",
    "description": "When Marine Corps pilot Jacob Merely crashes during a routine mission off the coast of Cyprus, he was sure it was game over. After surviving the crash and pulling himself onto the sandy shores of a long-abandoned island, however, Jacob unwittingly stumbles headfirst into the ancient ruins of a dead city. Unfortunately, he also stumbles into an age-old battle between good and evil—and he is now its newest recruit. The island once belonged to the Amazons, daughters of Ares, the God of War, and stood as the final bastion between the human world and the monstrosities of the Great Below. But Jacob's arrival has awakened the old gods and disturbed the seal holding the ravaging darkness at bay. Now, with the help of a sacred gem containing Ares' power, Jacob must recreate the Amazonian defenders of humanity and fortify the island stronghold. And if he fails, Hades will unleash his army of the damned and the world of men will fall, giving rise to an age of walking nightmares. Check out War God's Mantle by James A. Hunter, author of Rogue Dungeon and the litRPG epic Viridian Gate Online, and Aaron Crash, author of the bestselling American Dragons series. 'You had me at mythology. You sold me at the crafting, game mechanics, great characters, and serious action. From start to finish, War God's Mantle delivers. Do not miss this book!' — Harmon Cooper, author of Cheery Blossom Girls, Monster Hunt NYC,and House of Dolls.",
    "image": "war-gods-mantle-ascension.jpg",
    "series": {
      "name": "The War God Saga",
      "slug": "war-gods-mantle-ascension",
      "order": 1
    },
    "format": {
      "PRINT_BOOK_PAPER_BACK": {
        "url": "https://a.co/d/e2zwn04",
        "createDate": "2018-01-09T05:28:32.686Z"
      },
      "ebook": {
        "url": "https://a.co/d/h8itbfD",
        "createDate": "2018-01-18T05:28:32.686Z"
      },
      "audiobook": {
        "url": "https://a.co/d/5gMfBNL",
        "createDate": "2018-02-20T05:28:32.686Z"
      }
    }
  },
  {
    "bookId": 7,
    "title": "War God's Mantle: Descent",
    "description": "A Marine turned Greek God. An army of beautiful Amazons. An infernal enemy out to burn the world down. It's been three weeks since Jacob Merely crash-landed on the mythical island of Lycastia, and the newly minted War God finally has things under control. He's grown into his power, built his city, and earned the respect of his gorgeous, hard-charging Amazons. He's not in the clear yet, though. Hades still lives, and the mystical sigil holding him at bay is rapidly failing. Worse, a horde of new enemies is battering Lycastia's gates daily, slowly grinding down Jacob's forces. But Jacob has a plan to get the upper hand. He's learned about a legendary weapon buried in a prehistoric world deep in the bowels of the island. A weapon with the power to kill even gods. If he can defeat the weapon's primordial guardians and subdue an exiled Titan, he might just be able to save the world. But that's an awfully big if … Continue reading War God's Mantle, a litRPG Harem adventure by James A. Hunter, author of Viridian Gate Online, and Aaron Crash, author of the Galactic Demon Hunters series.",
    "image": "war-gods-mantle-descent.jpg",
    "series": {
      "name": "The War God Saga",
      "slug": "war-gods-mantle-descent",
      "order": 2
    },
    "format": {
      "PRINT_BOOK_PAPER_BACK": {
        "url": "https://a.co/d/1D0BXZ6",
        "createDate": "2018-06-26T05:28:32.686Z"
      },
      "ebook": {
        "url": "https://a.co/d/iwRfap0",
        "createDate": "2018-06-12T05:28:32.686Z"
      },
      "audiobook": {
        "url": "https://a.co/d/j9MR0BP",
        "createDate": "2018-07-18T05:28:32.686Z"
      }
    }
  },
  {
    "bookId": 8,
    "title": "Robot Bangarang",
    "description": "Blaze is a highly trained astral marine, fighting demons and saving lives, so he should know better than to bed his latest client. And yet, when she puts a hex on him, suddenly women find him irresistible. Even his ex-wife is eyeing him, which is a problem, because she's an evil witch. Literally. Together, Blaze and Mara form an uneasy alliance with a misfit crew of aliens and monsters to track down demons, snare ghosts, and destroy hellish creatures bent on murder--all while trying to close the gates of hell forever.<br /> <br />There's just one problem. A demon-possessed robot has infiltrated their starship, the Lizzie Borden, and a vicious coven of stellar vampires have stranded them in a graveyard of ships at the edge of known space. All the while, the women on his crew won't leave Blaze alone! From Aaron Crash, author of the American Dragons series and the litRPG epic War God's Mantle, comes a brand new shoot-em-up, action adventure, paranormal space opera you won't want to put down. This novel contains swearing, violence, cyborg vampires, and a harem of beautiful if somewhat inhuman women that the hero regularly sleeps with--when he's not hunting demons. Enjoy! A Note from the Author: ROBOT BANGARANG was originally published as DAMNATION ROBOT and what you are about to read is the re-mix. Now, this is important, if you already read DAMNATION ROBOT, you might think twice about this book. There are a lot of similarities.<br /><br /> I eased up on some of the horror elements and added some sexy times, so those scenes involve one or more beautiful women, but a lot of the main plot is still the same. Still, if you read and LOVED DR, this will be a variation on something you already like, which can be fun. I hope it's fun because I really liked these books. They didn't quite find their audience, however. Sad face. I'm hoping with a little re-imagining, they'll find readers who like a little spicy in their supernatural space opera. Happy face! Now, if you didn't read DAMNATION ROBOT at all, you're totally fine. I'm Aaron Crash and I approve of this book. I'd like to thank Shadow Alley Press for allowing the re-mix. Also, thanks to Byl Karvetz for being a fan, and all the people who read and left reviews.",
    "image": "robert.jpg",
    "series": {
      "name": "Full Frontal Galaxy",
      "slug": "robot-bangarang",
      "order": 3
    },
    "format": {
      "PRINT_BOOK_PAPER_BACK": {
        "url": "https://a.co/d/gBz4XZ7",
        "createDate": "2019-11-15T05:28:32.686Z"
      },
      "ebook": {
        "url": "https://a.co/d/eQSsMbg",
        "createDate": "2019-06-25T05:28:32.686Z"
      },
      "audiobook": {
        "url": "https://a.co/d/gHjnfpm",
        "createDate": "2020-01-21T05:28:32.686Z"
      }
    }
  },
  {
    "bookId": 9,
    "title": "Robot Bangarang",
    "description": "Blaze is a highly trained astral marine, fighting demons and saving lives, so he should know better than to bed his latest client. And yet, when she puts a hex on him, suddenly women find him irresistible. Even his ex-wife is eyeing him, which is a problem, because she's an evil witch. Literally. Together, Blaze and Mara form an uneasy alliance with a misfit crew of aliens and monsters to track down demons, snare ghosts, and destroy hellish creatures bent on murder--all while trying to close the gates of hell forever. There's just one problem. A demon-possessed robot has infiltrated their starship, the Lizzie Borden, and a vicious coven of stellar vampires have stranded them in a graveyard of ships at the edge of known space. All the while, the women on his crew won't leave Blaze alone! From Aaron Crash, author of the American Dragons series and the litRPG epic War God's Mantle, comes a brand new shoot-em-up, action adventure, paranormal space opera you won't want to put down. This novel contains swearing, violence, cyborg vampires, and a harem of beautiful if somewhat inhuman women that the hero regularly sleeps with--when he's not hunting demons. Enjoy! A Note from the Author: ROBOT BANGARANG was originally published as DAMNATION ROBOT and what you are about to read is the re-mix. Now, this is important, if you already read DAMNATION ROBOT, you might think twice about this book. There are a lot of similarities. I eased up on some of the horror elements and added some sexy times, so those scenes involve one or more beautiful women, but a lot of the main plot is still the same. Still, if you read and LOVED DR, this will be a variation on something you already like, which can be fun. I hope it's fun because I really liked these books. They didn't quite find their audience, however. Sad face. I'm hoping with a little re-imagining, they'll find readers who like a little spicy in their supernatural space opera. Happy face! Now, if you didn't read DAMNATION ROBOT at all, you're totally fine. I'm Aaron Crash and I approve of this book. I'd like to thank Shadow Alley Press for allowing the re-mix. Also, thanks to Byl Karvetz for being a fan, and all the people who read and left reviews.",
    "image": "robert.jpg",
    "series": {
      "name": "Full Frontal Galaxy",
      "slug": "robot-bangarang",
      "order": 2
    },
    "format": {
      "PRINT_BOOK_PAPER_BACK": {
        "url": "https://a.co/d/gBz4XZ7",
        "createDate": "2019-11-15T05:28:32.686Z"
      },
      "ebook": {
        "url": "https://a.co/d/eQSsMbg",
        "createDate": "2019-06-25T05:28:32.686Z"
      },
      "audiobook": {
        "url": "https://a.co/d/gHjnfpm",
        "createDate": "2020-01-21T05:28:32.686Z"
      }
    }
  },
  {
    "bookId": 10,
    "title": "Robot Bangarang 4",
    "description": "Blaze is a highly trained astral marine, fighting demons and saving lives, so he should know better than to bed his latest client. And yet, when she puts a hex on him, suddenly women find him irresistible. Even his ex-wife is eyeing him, which is a problem, because she's an evil witch. Literally. Together, Blaze and Mara form an uneasy alliance with a misfit crew of aliens and monsters to track down demons, snare ghosts, and destroy hellish creatures bent on murder--all while trying to close the gates of hell forever. There's just one problem. A demon-possessed robot has infiltrated their starship, the Lizzie Borden, and a vicious coven of stellar vampires have stranded them in a graveyard of ships at the edge of known space. All the while, the women on his crew won't leave Blaze alone! From Aaron Crash, author of the American Dragons series and the litRPG epic War God's Mantle, comes a brand new shoot-em-up, action adventure, paranormal space opera you won't want to put down. This novel contains swearing, violence, cyborg vampires, and a harem of beautiful if somewhat inhuman women that the hero regularly sleeps with--when he's not hunting demons. Enjoy! A Note from the Author: ROBOT BANGARANG was originally published as DAMNATION ROBOT and what you are about to read is the re-mix. Now, this is important, if you already read DAMNATION ROBOT, you might think twice about this book. There are a lot of similarities. I eased up on some of the horror elements and added some sexy times, so those scenes involve one or more beautiful women, but a lot of the main plot is still the same. Still, if you read and LOVED DR, this will be a variation on something you already like, which can be fun. I hope it's fun because I really liked these books. They didn't quite find their audience, however. Sad face. I'm hoping with a little re-imagining, they'll find readers who like a little spicy in their supernatural space opera. Happy face! Now, if you didn't read DAMNATION ROBOT at all, you're totally fine. I'm Aaron Crash and I approve of this book. I'd like to thank Shadow Alley Press for allowing the re-mix. Also, thanks to Byl Karvetz for being a fan, and all the people who read and left reviews.",
    "image": "robert.jpg",
    "series": {
      "name": "Full Frontal Galaxy",
      "slug": "robot-bangarang",
      "order": 4
    },
    "format": {
      "PRINT_BOOK_PAPER_BACK": {
        "url": "https://a.co/d/gBz4XZ7",
        "createDate": "2019-11-15T05:28:32.686Z"
      },
      "ebook": {
        "url": "https://a.co/d/eQSsMbg",
        "createDate": "2019-06-25T05:28:32.686Z"
      }
    }
  }
]
