[
  {
    "slug": "full-frontal-galaxy",
    "name": "Full Frontal Galaxy",
    "description": "In a universe filled with demons, vampires, werewolves, and other ancient evils, a highly trained astral marine gathers a misfit crew of beautiful women, strange aliens, and a kung-fu sloth to close the gates of hell forever. The Full Frontal Galaxy books are horror/sci-fi harem books filled with sex and violence.",
    "menuOrder": 9
  },
  {
    "slug": "creature-girl-creations",
    "name": "Creature Girl Creations",
    "description": "Roy Boss, the CEO of VentureForge Industries, awakens in a different galaxy on the planet Plymouth—a world where monsters are designed and printed for his game worlds. Stripped of his company and original body, and pursued by robotic dogs programmed to kill, Roy utilizes advanced 3D printers to create sentient, superpowered monster girls to aid him in reclaiming his empire. Note: This science fiction harem trilogy contains explicit content and is intended for mature readers.",
    "menuOrder": 6
  },
  {
    "slug": "the-war-god-saga",
    "name": "The War God Saga",
    "description": "War God&#39;s Mantle is a LitRPG harem adventure that follows Marine Corps pilot, Jacob Merely, who accidentally crashes his plane on an island off the coast of Cypress. Stranded, Jacob comes across a dying Ares, the God of War. Ares gives Jacob the power to forge an army of Amazons to save both the island and the world from the evil god of death. Jacob will have to level up his skills, forge warrior women, and master any number of ancient artifacts to defend himself and his army from Hades himself.",
    "menuOrder": 4
  },
  {
    "slug": "rage-king",
    "name": "Rage King",
    "description": "Colt Holliday has spent his life learning to control his anger—until an ancient god of rage possesses him, amplifying his fury to supernatural levels. As Colt navigates this new reality, he discovers a hidden world of vampires, werewolves, and demons, all eager to claim his newfound power. To manage the god&#39;s rage and survive these threats, Colt forms intimate bonds with a diverse group of women, including a nerdy girl possessed by the goddess of lust and a melancholic vampire who vowed never to love again. Note: This urban fantasy harem adventure contains explicit content and is intended for mature readers.",
    "menuOrder": 7
  },
  {
    "slug": "princesses-of-the-ironbound",
    "name": "Princesses of the Ironbound",
    "description": "Ymir is a barbarian from the frozen north, cursed with magic and exiled from his tribe. Seeking mastery over his newfound powers, he enrolls at Old Ironbound, a prestigious university where the elite study magic. Ymir must navigate academic challenges, deadly conspiracies, and complex relationships with a diverse group of women, including humans, elves, orcs, and dwarves. . Note: This magic academy harem series contains explicit content and is intended for mature readers.",
    "menuOrder": 3
  },
  {
    "slug": "masters-of-reality",
    "name": "Masters of Reality",
    "description": "The Masters of Reality trilogy is a steam harem adventure like no other. Jeremy &quot;Jem&quot; Creed and his wife Crystal are seeing a fresh start on the island of Paradeisos. What they find is stranger than they could have ever imagined: the locals are named after Greek gods, horned thugs lurk in back alleys, and the women are strangely friendly. Jem and Crystal must unravel the secrets of the island before they find themselves lost in paradise forever. Note: This urban fantasy harem adventure contains explicit content and is intended for mature readers.",
    "menuOrder": 8
  },
  {
    "slug": "son-of-fire",
    "name": "Son of Fire",
    "description": "Stolen away to another world, Axel Drokharis finds himself defending the village of Foulwater from demonic raiders. Axel must harness this new world&#39;s magic, form a partnership with a very angry sorceress and a busty elf buccaneer, and discover his legacy as....the Son of Fire! Note: This isekai harem trilogy contains explicit content and is intended for mature readers.",
    "menuOrder": 5
  },
  {
    "slug": "american-dragons",
    "name": "American Dragons",
    "description": "Steven Whipp is just a poor college student until the night he’s shot, kissed, and reborn as a Dragonsoul, part of a hidden magical race that secretly rules the world. As the last of an ancient line of Dragonlords, he must unlock his powers through battle and passion while fending off assassins, rival dragons, and deadly conspiracies. In the end, Steven only wants one thing—to keep his harem of beautiful women safe.",
    "menuOrder": 2
  },
  {
    "slug": "land-of-lust",
    "name": "Land of Lust",
    "description": "Ancient magic? Alien Technology? Why not both? This is not a routine expedition...Sid Marshall's college field trip took an unexpected turn when one of his classmates drags him into the bushes for a little unexpected anatomy lesson. Then? Sid and two women—his hot MILF professor and his bratty cheerleader crush—are all grabbed by an energy storm and flung to a strange patchwork world, like someone chopped up a thousand planets and quilted them together. Infected by alien technology, Sid is given the strength and the skills to keep him and his women alive as they discover the secrets of a world filled with magic, dinosaurs, spaceships, and a mysterious huntress haunting the forests.",
    "menuOrder": 1
  }
]
